''' Да се напише програма, която генерира трицифрени PIN кодове, като цифрите на всеки PIN код са в определен интервал. За да бъде валиден един PIN код той трябва да отговаря на следните условия:
Първата и третата цифра трябва да бъдат четни.
Втората цифра трябва да бъде просто число в диапазона [2...7].
Вход
От конзолата се четат 3 реда:
Горната граница на първото число - цяло число в диапазона [1...9]
Горната граница на второто число - цяло число в диапазона [1...9]
Горната граница на третото число - цяло число в диапазона [1...9]
Изход
Да се отпечатат на конзолата всички валидни трицифрени PIN кодове, чиито цифри отговарят на съответните интервали. '''

num_one = int(input())
num_two = int(input())
num_three = int(input())

for one in range(1, num_one + 1):
    for two in range(1, num_two + 1):
        for three in range(1, num_three + 1):
            if one % 2 == 0 and three % 2 == 0 and str(two) in "2357":
                print(f"{one} {two} {three}")
