''' Имаме банкноти и монети по 1лв., по 2лв. и по 5лв. Да се напише програма, която прочита въведените от
потребителя брой банкноти и монети и сума, и извежда на екран всички възможни начини по които сумата може да се
изплати с наличните банкноти.
Вход
Входът се чете от конзолата и съдържа точно 4 реда:
1.	Брой монети по 1лв. - цяло положително число;
2.	Брой монети по 2лв. - цяло положително число;
3.	Брой банкноти по 5лв. - цяло положително число;
4.	Сума - цяло положително число в интервала [1…1000];
Изход
Да се отпечатат на конзолата всички комбинации от дадените номинали, образуващи сумата, форматирани по следния начин:
o	"{бр. 1лв.} * 1 lv. + {бр. 2лв.} * 2 lv. + {бр. 5лв.} * 5 lv. = {сума} lv." '''

coins_by_one = int(input())
coins_by_two = int(input())
cash_by_five = int(input())
total_sum = int(input())

coins_by_one_used = 0
coins_by_two_used = 0
cash_by_five_used = 0

for num in range(coins_by_one + 1):
    for num2 in range(coins_by_two + 1):
        for num3 in range(cash_by_five + 1):
            if num * 1 + num2 * 2 + num3 * 5 == total_sum:
                coins_by_one_used = num
                coins_by_two_used = num2
                cash_by_five_used = num3
                print(f"{num} * 1 lv. + {num2} * 2 lv. + {num3} * 5 lv. = {total_sum} lv.")
