''' Поздравления, поради вашите задълбочени знания в сферата на програмирането МВР реши да наеме точно вас за
създаването на новата им система за генериране на специални автомобилни номера.
Всеки един специален автомобилен номер се състой от четири числа. Условията, които разграничават специалните от
обикновените номера са следните:
•	Ако номерът започва с четна цифра, то той трябва да завършва на нечетна цифра и обратното – ако започва с нечетна,
    завършва на четна
•	Първата цифра от номера е по-голяма от последната
•	Сумата от втората и третата цифра трябва да е четно число
Входа се състой от две числа - начало и край на интервал, между които трябва да се генерира всяко едно число от номера.
1.	Първи ред - едноцифрено число - началото на интервала – цяло число в интервала [1…9]
2.	Втори ред - едноцифрено число - края на интервала – цяло число в интервала [1…9]
Изход
На конзолата трябва да се отпечатат всички специални номера, разделени с интервал. '''

interval_start = int(input())
interval_finish = int(input())

for num1 in range(interval_start, interval_finish + 1):
    for num2 in range(interval_start, interval_finish + 1):
        for num3 in range(interval_start, interval_finish + 1):
            for num4 in range(interval_start, interval_finish + 1):
                if num1 % 2 == 0 and num4 % 2 == 1 or num1 % 2 == 1 and num4 % 2 == 0:
                    if num1 > num4 and (num2 + num3) % 2 == 0:
                        number1 = str(num1)
                        number2 = str(num2)
                        number3 = str(num3)
                        number4 = str(num4)
                        special_number = number1 + number2 + number3 + number4
                        special_number = int(special_number)
                        print(f"{special_number}", end=" ")
