''' В града има тайна врата, за която всички знаят, но никой не е успявал да я отключи и да види какво има зад нея.
За да бъде отключена трябва да се въведе трицифрен код.
Напишете програма, която генерира комбинации спрямо въведени числа – предположения от потребителя.
От конзолата се въвеждат три цифри. Тези цифри ще бъдат горната граница, до която ние искаме да получим
всички трицифрени числа, на които всяка една цифра отговаря на следните условия:
•	Цифрата на единиците и цифрата на стотиците трябва да бъде четна
•	Цифрата на десетиците да бъде просто число в диапазона (2...7).
Това ще са възможните комбинации според въведените предположения от потребителя, с които ще може евентуално
да се отключи вратата.
От конзолата се четат 3 реда:
•	Горната граница на стотиците - цяло число в диапазона (1-9)
•	Горната граница на десетиците - цяло число в диапазона (1-9)
•	Горната граница на единиците - цяло число в диапазона (1-9)
Изход
Да се отпечатат на конзолата всички трицифрени числа, за които всяка една част отговаря на условията по-горе. '''

number_one = int(input())
number_two = int(input())
number_three = int(input())

for hundreds in range(1, number_one + 1):

    for tens in range(1, number_two + 1):

        for units in range(1, number_three + 1):

            if hundreds % 2 == 0 and units % 2 == 0 and str(tens) in "2357":
                print(f"{hundreds} {tens} {units}")

# number_one = int(input())
# number_two = int(input())
# number_three = int(input())
#
# prime_numbers = [2, 3, 5, 7]
#
# for hundreds in range(1, number_one + 1):
#
#     for tens in range(1, number_two + 1):
#
#         for units in range(1, number_three + 1):
#
#             if hundreds % 2 == 0 and units % 2 == 0 and tens in prime_numbers:
#                 print(f"{hundreds} {tens} {units}")
