''' Напишете програма, която първоначално прочита име и парола на потребителски профил.
След това чете парола за вход.
•	при въвеждане на грешна парола: потребителя да се подкани да въведе нова парола.
•	при въвеждане на правилна парола: отпечатваме "Welcome {username}!". '''

username = input()
password = input()

data = input()  # data ако е равнa на password отива директно на print
while data != password:  # но докато условието data да е различнa от password въртим цикъла
    data = input()

print(f"Welcome: {username}!")
