''' Курсът "Train the trainers" е към края си и финалното оценяване наближава.
Вашата задача е да помогнете на журито, което ще оценява презентациите, като напишете програма,
в която да изчислява средната оценка от представянето на всяка една презентация от даден студент,
а накрая - средния успех от всички тях.
От конзолата на първият ред се прочита броят на хората в журито n - цяло число.
След това на отделен ред се прочита името на презентацията – текст.
За всяка една презентация на нов ред се четат n - на брой оценки - реално число.
След изчисляване на средната оценка за конкретна презентация, на конзолата се печата:
 "{името на презентацията} - {средна оценка}."
След получаване на команда "Finish", на конзолата се печата
"Student's final assessment is {среден успех от всички презентации}." и програмата приключва.
Всички оценки трябва да бъдат форматирани до втория знак след десетичната запетая. '''

judges = int(input())
total_grades = 0
total_grades_sum = 0

while True:
    presentation_name = input()  # прочитаме името на презентацията

    if presentation_name == "Finish":  # брейкваме ако имаме "Finish"
        break
    grades_sum = 0  # добавяме променлива да пази общата оценка

    for _ in range(judges):
        grades_sum += float(input())  # за всеки съдия добавяме оценка

    total_grades_sum += grades_sum
    total_grades += judges  # броя на съдиите е равен на броя на оценките

    print(f"{presentation_name} - {grades_sum / judges:.2f}.")
print(f"Student's final assessment is {total_grades_sum / total_grades:.2f}.")
