# Напишете програма, която чете две цели числа (N1 и N2) и оператор,
# с който да се извърши дадена математическа операция.
# Възможните операции са: Събиране(+), Изваждане(-), Умножение(*),  Деление(/) и Модулно деление(%).
# При събиране, изваждане и умножение на конзолата трябва да се отпечатат
# резултата и дали той е четен или нечетен.
# При обикновеното деление - резултата. При модулното деление - остатъка.
# Трябва да се има предвид, че делителят може да е равен на 0 (нула), а на нула не се дели.
# В този случай трябва да се отпечата специално съобщениe.
# Вход
# От конзолата се прочитат 3 реда, въведени от потребителя:
# N1 - цяло число;
# N2 - цяло число;
# Оператор - един символ измежду: "+", "-", "*", "/", "%".
# Изход
# Да се отпечата на конзолата един ред:
# Ако операцията е събиране, изваждане или умножение:
#  "{N1} {оператор} {N2} = {резултат} - {even/odd}"
# Ако операцията е деление:
# "{N1} / {N2} = {резултат}" - резултат, форматиран до втория знак след десетичната запетая
# Ако операцията е модулно деление:
# "{N1} % {N2} = {остатък}"
# В случай на деление с 0 (нула):
# "Cannot divide {N1} by zero"

num_one = int(input())
num_two = int(input())
operand = input()

result = None

if operand == "+":
    result = f"{num_one} + {num_two} = {num_one + num_two}" + (" - even" if (num_one + num_two) % 2 == 0 else " - odd")
elif operand == "-":
    result = f"{num_one} - {num_two} = {num_one - num_two}" + (" - even" if (num_one - num_two) % 2 == 0 else " - odd")
elif operand == "*":
    result = f"{num_one} * {num_two} = {num_one * num_two}" + (" - even" if (num_one * num_two) % 2 == 0 else " - odd")
elif num_two == 0:
    result = f"Cannot divide {num_one} by zero"
elif operand == "/":
    result = f"{num_one} / {num_two} = {num_one / num_two:.2f}"
elif operand == "%":
    result = f"{num_one} % {num_two} = {num_one % num_two}"

print(result)

# проверка дали можем да делим на 0 - по долния код не се изпълнява
#    if (num_one + num_two) % 2 == 0:
#       result += "- even"
#    else:
#        result += "- odd"
