''' компилационен език : C# , Java, C, C++, Swift е за IOS, Go, Rust
компилатора взима кода и го превежда на машинен език
компилатора намира грешките преди да се изпълни кода

интерпретаторен език : Python, JavaScript, PHP, Perl, Ruby
кодът се изпълнява директно от интерпретатора
Грешките се виждат след изпълнение на кода '''

''' Езиците могат да се делят на:
Статични езици: променливите са постоянно зададени и не се променят
C#, Java, Swift, C++
Динамични езици: променливите могат да се променят.
Python, JS, PHP
Има и комбинирани езици...
'''

''' declare variable in C#/Java
{data type}{variable name}={value}; 
variable name - camelCase '''
''' declare variable in JS/Python
'''