# Градинар продавал реколтата от градината си на зеленчуковата борса.
# Продава зеленчуци за N лева на килограм и плодове за M лева за килограм.
# Напишете програма, която да пресмята приходите от реколтата в евро ( ако приемем, че едно евро е равно на 1.94лв).
# Вход
# От конзолата се четат 4 числа, по едно на ред:
# •	Първи ред – Цена за килограм зеленчуци – реално число[0.00… 1000.00]
# •	Втори ред – Цена за килограм плодове – реално число[0.00… 1000.00]
# •	Трети ред – Общо килограми на зеленчуците – цяло число[0… 1000]
# •	Четвърти ред – Общо килограми на плодовете – цяло число[0… 1000]
# Изход
# Да се отпечата на конзолата едно число: приходите от всички плодове и зеленчуци в евро.
# Резултата да се форматира до втория знак след десетичния разделител.

vegetable_price_kg = float(input())
fruit_price_kg = float(input())
total_kilos_vegetable = int(input())
total_kilos_fruit = int(input())

EVRO = 1.94

total_price_for_all = (vegetable_price_kg * total_kilos_vegetable) + (fruit_price_kg * total_kilos_fruit)
total_price_euro = total_price_for_all / EVRO

print(f"{total_price_euro:.2f}")
