# Георги ще има гости вечерта и решава да ги нагости с паламуд, сафрид и миди.
# Затова отива на рибната борса, за да си купи по няколко килограма.
# Oт конзолата се въвеждат цените в лева на скумрията и цацата.
# Също количеството на паламуд, сафрид и миди в килограми.
# Колко пари ще са му необходими, за да плати сметката си, ако цените на борсата са:
# •	Паламуд – 60% по-скъп от скумрията
# •	Сафрид – 80% по-скъп от цацата
# •	Миди – 7.50 лв. за килограм
#  Вход
#  От конзолата се четат 5 числа:
# •	Първи ред – цена на скумрията на килограм. Реално число в интервала [0.00…40.00]
# •	Втори ред – цена на цацата на килограм. Реално число в интервала [0.00…30.00]
# •	Трети ред – килограма паламуд. Реално число в интервала [0.00…50.00]
# •	Четвърти ред – килограма сафрид. Реално число в интервала [0.00… 70.00]
# •	Пети ред – килограма миди. Цяло число в интервала [0 ... 100]
# Изход
# Да се отпечата на конзолата едно число с плаваща запетая:
# колко пари ще са нужни на Георги, за да си плати сметката.
# Числото трябва да е форматирано до вторият знак след десетичната запетая (1.2457 -> 1.25).

skumria_kilogram_price = float(input())
caca_kilogram_prise = float(input())
palamud_kilograms = float(input())
safrid_kilograms = float(input())
midi_kilograms = int(input())

palamud_kilogram_cena = skumria_kilogram_price + skumria_kilogram_price * 0.60
suma_palamud = palamud_kilograms * palamud_kilogram_cena

safrid_kilogram_cena = caca_kilogram_prise + caca_kilogram_prise * 0.80
suma_safrid = safrid_kilograms * safrid_kilogram_cena

midi_kilograms_price = midi_kilograms * 7.50

sum_fish = suma_safrid + suma_palamud + midi_kilograms_price
print(f"{sum_fish:.2f}")
