''' Напишете програма, която прочита скрито съобщение в поредица от символи.
Те се получават по един на ред до получаване на командата "End". Думите се образуват от буквите в реда на четенето им.
Символите, които не са латински букви трябва да бъдат игнорирани.
Думите скрити в потока са разделени от тайна команда от три букви – "c", "o" и "n".
При първото получаване на една от тези букви, тя се маркира като срещната, но не се запазва в думата.
При всяко следващо нейно срещане се записва нормално в думата. След като са налични и трите символа от командата,
се печата думата и интервал " ". Започва се нова дума, която по същия начин чака тайната команда, за да бъде отпечатана.
Вход
От конзолата се чете поредица от редове с един символ на всеки до получаване на командата "End".
Изход
На конзолата се печата на един ред всяка дума след тайната команда, следвана от интервал. '''

letter = input()  # въвеждаме всяка буква
word = ""  # събираме в тази променлива думата
special_letters = ""  # събираме след проверките по долу скритите букви
while letter != "End":
    if not letter.isalpha():   # проверяваме дали е латинска буква ако е да продължи(игнорираме я)
        letter = input()
        continue
    if letter == "c":  # проверяваме всяка буква от тайните дали е вече в тайната дума
        if "c" in special_letters:
            word += letter
        else:
            special_letters += letter
    elif letter == "o":
        if "o" in special_letters:
            word += letter
        else:
            special_letters += letter
    elif letter == "n":
        if "n" in special_letters:
            word += letter
        else:
            special_letters += letter
    else:
        word += letter
    if len(special_letters) == 3:  # при достигане на дължина 3 на тайната дума
        word += " "  # добавяме празно място след последната дума
        special_letters = ""  # нулираме променливата за тайната дума
        print(word, end="")  # принтираме думата на същия ред
        word = ""  # нулираме думата
    letter = input()  # и след всички проверки въвеждаме буква
